interface RulesType {
	id: number;
	rule: string;
}

// Список правил пользования веб чатом для его участников
export const rules: RulesType[] = [
	{
		id: 1,
		rule: 'Все задаваемые вопросы должны быть связаны с физикой.',
	},
	{
		id: 2,
		rule: 'Все получаемые ответы должны быть связаны с физикой и корректны.',
	},
	{
		id: 3,
		rule: 'Запрещается грубое поведение участников чата.',
	},
	{
		id: 4,
		rule: 'Мы не делаем за вас домашнюю работу/курсовую и прочие типы заданий.',
	},
	{
		id: 5,
		rule: 'Запрещается спам сообщений. Например, если на ваш вопрос не было ответа, задайте его еще раз на следующий день, возможно он оказался слишком сложным.',
	},
	{
		id: 6,
		rule: 'При освещении какой-либо новости запрещается использование сенсационных заголовков.',
	},
	{
		id: 7,
		rule: 'Нельзя вводить других участников чата в заблуждение. Опирайтесь только на "сухие" факты исследований.',
	},
];
